IRP/src/Documents/CustomersAdvancesClosing/CustomersAdvancesClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>CustomersAdvancesClosing</name>
 <registerRecords>AccumulationRegister.TM1030B_TransactionsKey</registerRecords>
 <registerRecords>InformationRegister.T2013S_OffsetOfAging</registerRecords>
 <registerRecords>InformationRegister.T2010S_OffsetOfAdvances</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.TM1020B_AdvancesKey</registerRecords>
 <registerRecords>InformationRegister.DELETE_T2012S_AdvancesCurrencyRevaluation</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>InformationRegister.DELETE_T2011S_TransactionsCurrencyRevaluation</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>BeginOfPeriod</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfPeriod</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_DontWriteNegativeDebtAsAdvance</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DontOffsetEmptyProjects</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:Document>

IRP/src/Documents/CustomersAdvancesClosing/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	ArrayOfErrors = PeriodClosingServer.GetOverlappingPeriods(ThisObject.Company, 
		ThisObject.BeginOfPeriod, 
		ThisObject.EndOfPeriod, 
		"CustomersAdvancesClosing", "BeginOfPeriod", "EndOfPeriod");
	For Each Error In ArrayOfErrors Do
		Cancel = True;
		CommonFunctionsClientServer.ShowUsersMessage(Error.Msg, "BeginOfPeriod", ThisObject);
	EndDo;	
EndProcedure
